#include "info.h"
const string info::hasse_diagram =
    "Диаграмма Хассе — это специальный вид диаграмм, используемый для "
    "графического представления частично упорядоченных множеств. Она "
    "показывает структуру упорядоченного множества в наиболее компактной "
    "и наглядной форме. На диаграмме Хассе каждый элемент множества изображается "
    "в виде точки (вершины) на плоскости. Если элемент x меньше элемента y (x ≤ y) "
    "и между ними нет других элементов z таких, что x < z < y (то есть y покрывает x), "
    "то эти вершины соединяются отрезком или кривой, причем меньший элемент располагается ниже большего.";

const string info::description = "";
const string info::variant_33_rule = "Z_8:\n a b c d e f g h\n b e d g h a f c";
